{"id":"b70b071c-3f3c-43f7-b78b-5365f58b6901","url":"index.html","title":"Home","isDefault":true,"meta":{"description":""},"content":{"header":{"id":"3b6f67ba-25a3-4446-9649-d8bd38798258","cells":[{"id":"e7a20b03-44b0-4bc5-b77e-cc2ec2618281","inline":null,"size":12,"content":{"plugin":{"name":"ory/editor/core/content/slate","version":"0.0.1"},"state":{"serialized":{"nodes":[{"kind":"block","type":"HEADINGS/HEADING-ONE","nodes":[{"kind":"text","text":"THOMAS AIDAN CURRAN"}]}]}}}}]},"main":{"id":"f848ae4e-9f4a-4dc6-8247-5e6921b39eea","cells":[{"id":"68bafee7-906a-4467-9bc2-0a898f7f629e","inline":null,"size":12,"content":{"plugin":{"name":"ory/editor/core/content/slate","version":"0.0.1"},"state":{"serialized":{"nodes":[{"kind":"block","type":"PARAGRAPH/PARAGRAPH","nodes":[{"kind":"text","text":"Thomas Aidan Curran  is an independent software developer, investor and advisor to numerous Internet companies. He left Deutsche Telekom in October 2012 where he was DT Fellow, Senior Vice President Technology and Innovation of Deutsche Telekom AG. Thomas initiated the DT Group’s program for fostering talented young engineers and software developers, while driving innovation in a number of strategic software programs including Android, Cloud Computing, Cyber Security, Windows Phone, and Software Factory."}]},{"kind":"block","type":"PARAGRAPH/PARAGRAPH","nodes":[{"kind":"text","text":"Thomas joined Deutsche Telekom AG in March 2009 as Chief Technology Officer Products and Innovation. In this role, he was responsible for transforming Group’s Innovation Management, Research and Development (Deutsche Telekom Laboratories), Internet Service Provider (T-Online), IPTV platform, (T-Home Entertain), and the mobile cloud product family (Connected Life and Work) into a more modern and agile product development organisation."}]},{"kind":"block","type":"PARAGRAPH/PARAGRAPH","nodes":[{"kind":"text","text":"Previously he worked for a number of technology companies including SAP, Microsoft, Groove Networks and IBM, as well as media companies including News Corp, Bertelsmann, and BBC. His work in the open source effort Digital Media Project stems from his interest in simplifying media distribution."}]},{"kind":"block","type":"PARAGRAPH/PARAGRAPH","nodes":[{"kind":"text","text":""}]},{"kind":"block","type":"PARAGRAPH/PARAGRAPH","nodes":[{"kind":"text","text":"Passionate about innovation and entrepreneurship, Thomas founded five high tech software companies in his career so far."}]}]}}}}]}}}